import wikipediaapi

wiki_wiki = wikipediaapi.Wikipedia(user_agent="rashminijayasundara@gmail.com",language='si')  # 'si' is the code for Sinhala

def get_page_text(title):
    page = wiki_wiki.page(title)
    if page.exists():
        return page.text
    else:
        return None

titles = ["පූසා","බල්ලා","අලියා","හරකා","මල","බෝලය","පරිගණකය","රූපවාහිනිය","එල්ලේ","වී වගාව","හේන් ගොවිතැන",
          "පාසල්","ආරෝග්‍යශාලා","පොත","වතුර","වැව","දාගැබ","මුහුද","උදෑසන","පොළොව","විවාහය","ළමයා","වැස්ස","හිරු",
          "චන්ද්‍රයා","තරු","ගුරුත්වාකර්ෂණය","ස්කන්ධය","ග්‍රහලෝක","ගිනි කඳු","වෛද්‍යවරයා","ඉලෙක්ට්‍රොනික තාක්‍ෂණය",
          "පරිගණක දෘඩාංග","පරිගණක මෘදුකාංග","පරිගණක මෙහෙයුම් පද්ධති","ස්ථිරාංග","ශ්‍රී ලංකාව","වැසි වනාන්තර",
          "ශ්‍රී ජයවර්ධනපුර කෝට්ටේ","කොළඹ","සිංහල බස","අඹ","කුරුණෑගල","ථේරවාද බුදු දහම","ඉස්ලාම්","ආගම්","ශ්‍රී ලාංකික දෙමළ",
          "එක්සත් රාජධානිය","කාර්මීකරණය","ශ්‍රී ලංකාවේ බුද්ධාගම","සිංහල අවුරුද්ද සමඟ බැඳුණු ජන ක්‍රීඩා","සිංහල සහ හින්දු අලුත් අවුරුද්ද",
          "වෙසක් උත්සවය","පොසොන් උත්සවය","මහින්දාගමනය","තිස්තුන්කෝටියක් දෙවි දේවතාවියෝ","රත්නපුර","මහනුවර","අනුරාධපුරය",
          "පොළොන්නරුව","සීගිරිය","දඹුල්ල","ශ්‍රී පාදස්ථානය","ශ්‍රී ලංකාවේ සංචාරක ව්‍යාපාරය",]

with open("C:/Users/ASUS/Desktop/FYP/Codes/SpellCorrectorDataset/wiki.txt", "w", encoding="utf-8") as f:
    for title in titles:
        text = get_page_text(title)
        if text:
            f.write(f"Title: {title}\n")
            f.write(text)
            f.write("\n" + "-" * 80 + "\n\n")
        else:
            f.write(f"Page '{title}' not found.\n\n")
